package com.javarush.test.level09.lesson11.home08;

import java.util.ArrayList;
import java.util.Random;

/* Список из массивов чисел
Создать список, элементами которого будут массивы чисел. Добавить в список пять объектов–массивов длиной 5, 2, 4, 7, 0 соответственно. Заполнить массивы любыми данными и вывести их на экран.
*/

public class Solution
{
    public static void main(String[] args)
    {
        ArrayList<int[]> list = createList();
        printList(list);
    }

    public static ArrayList<int[]> createList()
    {
        //напишите тут ваш код
        ArrayList<int[]> lists = new ArrayList<int[]>();
        int[] lengthsOfArrays = {5,2,4,7,0};
        for (int length: lengthsOfArrays){
            int[] numbers = new int[length];
            for (int i = 0; i <= numbers.length-1; i++)
            {
                numbers[i] = new Random().nextInt();
            }

            lists.add(numbers);
        }
        return lists;
    }

    public static void printList(ArrayList<int[]> list)
    {
        for (int[] array: list )
        {
            for (int x: array)
            {
                System.out.println(x);
            }
        }
    }
}
